Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8490.PIC
        <edc:SFRDef edc:access="nnnn----" edc:cname="PORTE" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTE" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF84">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RE4" edc:desc="" edc:mask="0x1" edc:name="RE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE5" edc:desc="" edc:mask="0x1" edc:name="RE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE6" edc:desc="" edc:mask="0x1" edc:name="RE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE7" edc:desc="" edc:mask="0x1" edc:name="RE7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LCDBIAS1" edc:desc="" edc:mask="0x1" edc:name="LCDBIAS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDBIAS2" edc:desc="" edc:mask="0x1" edc:name="LCDBIAS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDBIAS3" edc:desc="" edc:mask="0x1" edc:name="LCDBIAS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COM0" edc:desc="" edc:mask="0x1" edc:name="COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COM1" edc:desc="" edc:mask="0x1" edc:name="COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COM2" edc:desc="" edc:mask="0x1" edc:name="COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COM3" edc:desc="" edc:mask="0x1" edc:name="COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31" edc:desc="" edc:mask="0x1" edc:name="SEG31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="BIAS1" edc:desc="" edc:mask="0x1" edc:name="BIAS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BIAS2" edc:desc="" edc:mask="0x1" edc:name="BIAS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BIAS3" edc:desc="" edc:mask="0x1" edc:name="BIAS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP2E" edc:desc="" edc:mask="0x1" edc:name="CCP2E" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CCP8E" edc:desc="" edc:mask="0x1" edc:name="CCP8E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7E" edc:desc="" edc:mask="0x1" edc:name="CCP7E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6E" edc:desc="" edc:mask="0x1" edc:name="CCP6E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PA2E" edc:desc="" edc:mask="0x1" edc:name="PA2E" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="PB3E" edc:desc="" edc:mask="0x1" edc:name="PB3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PC1E" edc:desc="" edc:mask="0x1" edc:name="PC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PB1E" edc:desc="" edc:mask="0x1" edc:name="PB1E" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u0000000" edc:name="PORTF" edc:nzwidth="0x8" edc:por="x0000000" edc:_addr="0xF85">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF0" edc:desc="" edc:mask="0x1" edc:name="RF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1" edc:desc="" edc:mask="0x1" edc:name="RF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2" edc:desc="" edc:mask="0x1" edc:name="RF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3" edc:desc="" edc:mask="0x1" edc:name="RF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4" edc:desc="" edc:mask="0x1" edc:name="RF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5" edc:desc="" edc:mask="0x1" edc:name="RF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6" edc:desc="" edc:mask="0x1" edc:name="RF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7" edc:desc="" edc:mask="0x1" edc:name="RF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN5" edc:desc="" edc:mask="0x1" edc:name="AN5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN6" edc:desc="" edc:mask="0x1" edc:name="AN6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN7" edc:desc="" edc:mask="0x1" edc:name="AN7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN8" edc:desc="" edc:mask="0x1" edc:name="AN8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN9" edc:desc="" edc:mask="0x1" edc:name="AN9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN10" edc:desc="" edc:mask="0x1" edc:name="AN10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN11" edc:desc="" edc:mask="0x1" edc:name="AN11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SS" edc:desc="" edc:mask="0x1" edc:name="SS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG18" edc:desc="" edc:mask="0x1" edc:name="SEG18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19" edc:desc="" edc:mask="0x1" edc:name="SEG19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20" edc:desc="" edc:mask="0x1" edc:name="SEG20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21" edc:desc="" edc:mask="0x1" edc:name="SEG21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22" edc:desc="" edc:mask="0x1" edc:name="SEG22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23" edc:desc="" edc:mask="0x1" edc:name="SEG23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG24" edc:desc="" edc:mask="0x1" edc:name="SEG24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25" edc:desc="" edc:mask="0x1" edc:name="SEG25" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2OUTF" edc:desc="" edc:mask="0x1" edc:name="C2OUTF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1OUTF" edc:desc="" edc:mask="0x1" edc:name="C1OUTF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CVREFF" edc:desc="" edc:mask="0x1" edc:name="CVREFF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--rnnnnn" edc:cname="PORTG" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PORTG" edc:nzwidth="0x8" edc:por="--xxxxxx" edc:_addr="0xF86">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RG0" edc:desc="" edc:mask="0x1" edc:name="RG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG1" edc:desc="" edc:mask="0x1" edc:name="RG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG2" edc:desc="" edc:mask="0x1" edc:name="RG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG3" edc:desc="" edc:mask="0x1" edc:name="RG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG4" edc:desc="" edc:mask="0x1" edc:name="RG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG5" edc:desc="" edc:mask="0x1" edc:name="RG5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TX2" edc:desc="" edc:mask="0x1" edc:name="TX2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX2" edc:desc="" edc:mask="0x1" edc:name="RX2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MCLR" edc:desc="" edc:mask="0x1" edc:name="MCLR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CK2" edc:desc="" edc:mask="0x1" edc:name="CK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT2" edc:desc="" edc:mask="0x1" edc:name="DT2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="VPP" edc:desc="" edc:mask="0x1" edc:name="VPP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SEG30" edc:desc="" edc:mask="0x1" edc:name="SEG30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29" edc:desc="" edc:mask="0x1" edc:name="SEG29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28" edc:desc="" edc:mask="0x1" edc:name="SEG28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27" edc:desc="" edc:mask="0x1" edc:name="SEG27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26" edc:desc="" edc:mask="0x1" edc:name="SEG26" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="C3OUTG" edc:desc="" edc:mask="0x1" edc:name="C3OUTG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RJPU" edc:desc="" edc:mask="0x1" edc:name="RJPU" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000uuuu" edc:name="PORTH" edc:nzwidth="0x8" edc:por="0000xxxx" edc:_addr="0xF87">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RH0" edc:desc="" edc:mask="0x1" edc:name="RH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH1" edc:desc="" edc:mask="0x1" edc:name="RH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH2" edc:desc="" edc:mask="0x1" edc:name="RH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH3" edc:desc="" edc:mask="0x1" edc:name="RH3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH4" edc:desc="" edc:mask="0x1" edc:name="RH4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH5" edc:desc="" edc:mask="0x1" edc:name="RH5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH6" edc:desc="" edc:mask="0x1" edc:name="RH6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH7" edc:desc="" edc:mask="0x1" edc:name="RH7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SEG47" edc:desc="" edc:mask="0x1" edc:name="SEG47" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG46" edc:desc="" edc:mask="0x1" edc:name="SEG46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG45" edc:desc="" edc:mask="0x1" edc:name="SEG45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG44" edc:desc="" edc:mask="0x1" edc:name="SEG44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG40" edc:desc="" edc:mask="0x1" edc:name="SEG40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG41" edc:desc="" edc:mask="0x1" edc:name="SEG41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG42" edc:desc="" edc:mask="0x1" edc:name="SEG42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG43" edc:desc="" edc:mask="0x1" edc:name="SEG43" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CCP9" edc:desc="" edc:mask="0x1" edc:name="CCP9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8" edc:desc="" edc:mask="0x1" edc:name="CCP8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7" edc:desc="" edc:mask="0x1" edc:name="CCP7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6" edc:desc="" edc:mask="0x1" edc:name="CCP6" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="PC3" edc:desc="" edc:mask="0x1" edc:name="PC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PB3" edc:desc="" edc:mask="0x1" edc:name="PB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PC1" edc:desc="" edc:mask="0x1" edc:name="PC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PB1" edc:desc="" edc:mask="0x1" edc:name="PB1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTJ" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTJ" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF88">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RJ0" edc:desc="" edc:mask="0x1" edc:name="RJ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ1" edc:desc="" edc:mask="0x1" edc:name="RJ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ2" edc:desc="" edc:mask="0x1" edc:name="RJ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ3" edc:desc="" edc:mask="0x1" edc:name="RJ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ4" edc:desc="" edc:mask="0x1" edc:name="RJ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ5" edc:desc="" edc:mask="0x1" edc:name="RJ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ6" edc:desc="" edc:mask="0x1" edc:name="RJ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ7" edc:desc="" edc:mask="0x1" edc:name="RJ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SEG32" edc:desc="" edc:mask="0x1" edc:name="SEG32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33" edc:desc="" edc:mask="0x1" edc:name="SEG33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34" edc:desc="" edc:mask="0x1" edc:name="SEG34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35" edc:desc="" edc:mask="0x1" edc:name="SEG35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39" edc:desc="" edc:mask="0x1" edc:name="SEG39" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38" edc:desc="" edc:mask="0x1" edc:name="SEG38" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37" edc:desc="" edc:mask="0x1" edc:name="SEG37" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36" edc:desc="" edc:mask="0x1" edc:name="SEG36" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATA" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF89">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LA0" edc:desc="" edc:mask="0x1" edc:name="LA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA1" edc:desc="" edc:mask="0x1" edc:name="LA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA2" edc:desc="" edc:mask="0x1" edc:name="LA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA3" edc:desc="" edc:mask="0x1" edc:name="LA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA4" edc:desc="" edc:mask="0x1" edc:name="LA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA5" edc:desc="" edc:mask="0x1" edc:name="LA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA6" edc:desc="" edc:mask="0x1" edc:name="LA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA7" edc:desc="" edc:mask="0x1" edc:name="LA7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATB" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF8A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LB0" edc:desc="" edc:mask="0x1" edc:name="LB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB1" edc:desc="" edc:mask="0x1" edc:name="LB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB2" edc:desc="" edc:mask="0x1" edc:name="LB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB3" edc:desc="" edc:mask="0x1" edc:name="LB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB4" edc:desc="" edc:mask="0x1" edc:name="LB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB5" edc:desc="" edc:mask="0x1" edc:name="LB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB6" edc:desc="" edc:mask="0x1" edc:name="LB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB7" edc:desc="" edc:mask="0x1" edc:name="LB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
